## 4. Data Analysis libraries

#### 4.1 write a program to get name and age from user and print

In [7]:
name=input('your name please: ')
age=int(input('your age please: '))
print((f'Welcome to ProITbridge {name}. your age is {age}'))

your name please: sathiya
your age please: 10
Welcome to ProITbridge sathiya. your age is 10

#### 4.2 To print only even numbers

In [16]:
num=int(input('Enter a number'))
for i in range(1 , num):
    if i%2==0:
        print(i)

Enter a number10
2
4
6
8

#### 4.3 To use try catch and handle exception  for number divisable zero

In [21]:
try:
    num1=int(input('Enter a number 1: '))
    num2=int(input('Enter a number 2: '))
    print(num1/num2)
except ZeroDivisionError as e:
    print('error:',e)

Enter a number 1: 10
Enter a number 2: 0
error: division by zero

#### 4.4 To get count of how many vowels in a string

In [23]:
vowels={'a','e','i','o','u'}
vowelsInUserInput=set()
userInput=input('Enter user input:')
vowelsCount=0;
for ch in userInput:
    try:
        if vowels.issuperset(ch)==True:
            vowelsInUserInput.add(ch)
    except ValueError as e:
        print(e)

print(f'Vovels count {len(vowelsInUserInput)}')

Enter user input:sathiya
Vovels count 2

#### 4.5 Reverse list without built in function

In [40]:
lstNames=['sathiya','sabari','inba','ashok']

In [41]:
for i in lstNames:
    print(i)

sathiya
sabari
inba
ashok

In [49]:
for i in range(len(lstNames)-1,-1,-1):
    print(lstNames[i])

ashok
inba
sabari
sathiya

##### 4.6.Create dictionary with 5 least key value pair

In [3]:
employee={123:{
    'name':'sathiya',
    'age':'20-10-1990',
    'department':'HR'
},124:{
    'name':'sabari',
    'age':'10-10-2002',
    'department':'IT'
},
445:{
    'name':'inba',
    'age':'12-12-2003',
    'department':'Finance'
}}

In [4]:
type(employee)

dict

In [5]:
employee.get(123)

{'name': 'sathiya', 'age': '20-10-1990', 'department': 'HR'}

In [6]:
employee.get(123).get('age')

'20-10-1990'

### 4.7 Write pandas code to read csv file and print top 10 rows

In [3]:
!pip install pandas

Requirement already satisfied: pandas in /Library/Frameworks/Python.framework/Versions/3.7/lib/python3.7/site-packages (1.1.5)
Requirement already satisfied: python-dateutil>=2.7.3 in /Library/Frameworks/Python.framework/Versions/3.7/lib/python3.7/site-packages (from pandas) (2.9.0.post0)
Requirement already satisfied: pytz>=2017.2 in /Library/Frameworks/Python.framework/Versions/3.7/lib/python3.7/site-packages (from pandas) (2025.2)
Requirement already satisfied: numpy>=1.15.4 in /Library/Frameworks/Python.framework/Versions/3.7/lib/python3.7/site-packages (from pandas) (1.21.6)
Requirement already satisfied: six>=1.5 in /Library/Frameworks/Python.framework/Versions/3.7/lib/python3.7/site-packages (from python-dateutil>=2.7.3->pandas) (1.16.0)

In [4]:
import pandas as pd

csproducts=pd.read_csv('/Users/sathiyarajvenkatachalapathy/learning/python/jupyter/python/products.csv')
csproducts.describe()
csproducts.head(5)

,Index,Name,Description,Brand,Category,Price,Currency,Stock,EAN,Color,Size,Availability,Internal ID
0,1,Compact Printer Air Advanced Digital,Situation organization these memory much off.,"Garner, Boyle and Flynn",Books & Stationery,265,USD,774,2091465262179,ForestGreen,Large,pre_order,56
1,2,Tablet,Discussion loss politics free one thousand.,Mueller Inc,Shoes & Footwear,502,USD,81,5286196620740,Black,8x10 in,in_stock,29
2,3,Smart Blender Cooker,No situation per.,"Lawson, Keller and Winters",Kitchen Appliances,227,USD,726,1282898648918,SlateGray,XS,in_stock,70
3,4,Advanced Router Rechargeable,For force gas energy six laugh.,Gallagher and Sons,Kitchen Appliances,121,USD,896,3879177514583,PaleGreen,L,discontinued,31
4,5,Portable Mouse Monitor Phone,Feeling back religious however author room sci...,Irwin LLC,Kids' Clothing,1,USD,925,9055773261265,SeaShell,100x200 mm,discontinued,10

### 4.8 Write Dataframe from python dictionary

In [1]:
!pip install numpy

Requirement already satisfied: numpy in /Library/Frameworks/Python.framework/Versions/3.7/lib/python3.7/site-packages (1.21.6)

In [3]:
import pandas as pd
import numpy as np

employee={
    'empId':[101,100,102,np.nan,105],
    'name': ['sathiya','sabari','inba','ashok','selva'],
    'department':['HR','Finance','IT','Engineering','Security'],
    'age':[23,44,45,24,np.nan],
    'salary':[np.nan,24300.00,8400.00,3400.00,5400.12]
}
empDataFrame=pd.DataFrame(employee)
print(empDataFrame)

   empId     name   department   age    salary
0  101.0  sathiya           HR  23.0       NaN
1  100.0   sabari      Finance  44.0  24300.00
2  102.0     inba           IT  45.0   8400.00
3    NaN    ashok  Engineering  24.0   3400.00
4  105.0    selva     Security   NaN   5400.12

In [5]:
type(empDataFrame)

pandas.core.frame.DataFrame

In [7]:
empDataFrame.describe()

            empId        age        salary
count    4.000000   4.000000      4.000000
mean   102.000000  34.000000  10375.030000
std      2.160247  12.138094   9508.001999
min    100.000000  23.000000   3400.000000
25%    100.750000  23.750000   4900.090000
50%    101.500000  34.000000   6900.060000
75%    102.750000  44.250000  12375.000000
max    105.000000  45.000000  24300.000000

In [10]:
empDataFrame.isna()

   empId   name  department    age  salary
0  False  False       False  False    True
1  False  False       False  False   False
2  False  False       False  False   False
3   True  False       False  False   False
4  False  False       False   True   False

In [11]:
empDataFrame.fillna(empDataFrame.mean())

   empId     name   department   age    salary
0  101.0  sathiya           HR  23.0  10375.03
1  100.0   sabari      Finance  44.0  24300.00
2  102.0     inba           IT  45.0   8400.00
3  102.0    ashok  Engineering  24.0   3400.00
4  105.0    selva     Security  34.0   5400.12

####    4.10 filter rows where age is greater then 30

In [12]:
empDataFrame

   empId     name   department   age    salary
0  101.0  sathiya           HR  23.0       NaN
1  100.0   sabari      Finance  44.0  24300.00
2  102.0     inba           IT  45.0   8400.00
3    NaN    ashok  Engineering  24.0   3400.00
4  105.0    selva     Security   NaN   5400.12

In [17]:
empDataFrame.filter(empDataFrame.age>30)

Empty DataFrame
Columns: []
Index: [0, 1, 2, 3, 4]

In [16]:
empDataFrame[empDataFrame['age']>30]

   empId    name department   age   salary
1  100.0  sabari    Finance  44.0  24300.0
2  102.0    inba         IT  45.0   8400.0